ArtShareAPI/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        artworks = Artwork.all