ArtShareAPI/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            artworks = Artwork.where(artist_id: params[:user_id])
            artwork_shares = ArtworkShare.where(viewer_id: params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" IS NULL
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 2]]

      def update
          artwork = Artwork.find(params[:id])

          if artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "Ruby 7"], ["image_url", "ruby7.com"], ["artist_id", 2], ["updated_at", "2023-06-08 18:36:17.939650"], ["id", 5]]