ArtShareAPI/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)

    if comment.save
---
INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "\"Friday is coming\""], ["author_id", 2], ["artwork_id", 2], ["created_at", "2023-06-08 21:23:51.710925"], ["updated_at", "2023-06-08 21:23:51.710925"]]

  def index
    if params.has_key?(:user_id) && !params.has_key?(:artwork_id)
      comments = Comment.where(author_id: params[:user_id])
      render json: comments
      return
    elsif params.has_key?(:artwork_id)
      comments = Comment.where(artwork_id: params[:artwork_id])
      render json: comments
      return
    end
    comment = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
SELECT "comments".* FROM "comments"

  def destroy
    comment = Comment.find(params[:id])
    comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]