ArtShareAPI/app/controllers/users_controller.rb

    def index
      users = User.all.order(:id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "charmeleon"], ["updated_at", "2023-06-07 21:32:02.895804"], ["id", 1]]