FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "appAcademy"], ["email", "appAcademy@gmail.com"], ["created_at", "2023-06-07 21:02:21.218833"], ["updated_at", "2023-06-07 21:02:21.218833"]]
---
    def create
      user = User.new(params.require(:user).permit(:name, :email))
      user.save!